{"meta":{"title":"Liyinghao的博客","subtitle":"一只爱音乐偶尔有点小文艺的业余程序员","description":"一只爱音乐偶尔有点小文艺的业余程序员。目前主要使用python等进行各种爬虫、测试等开发，熟悉使用linux系统，掌握基本服务器知识。此为博客一枚。欢迎与我交朋友---扣扣：1216711554。","author":"Yinghao Li","url":"http://angellyh.coding.me"},"pages":[],"posts":[{"title":"再见2016你好2017","slug":"再见2016你好2017","date":"2016-12-31T15:54:38.000Z","updated":"2016-12-31T15:55:27.975Z","comments":true,"path":"posts/2016/12/31/再见2016你好2017.html","link":"","permalink":"http://angellyh.coding.me/posts/2016/12/31/再见2016你好2017.html","excerpt":"又是一年春夏秋冬，2016已经准备离去，2017准备到来，在家写下这篇有关于2016和2017的文章 :)","keywords":[],"text":"又是一年春夏秋冬，2016已经准备离去，2017准备到来，在家写下这篇有关于2016和2017的文章 :) 关于鸡汤在这个2016年，听过了身边不少人也看过空间朋友圈里不少人说的道理。 有人说：不拼一把，怎么会知道自己真的不行？ 也有人说：有些事就算努力了也没有结果的。 但在数个迷茫的、心灰意冷的夜晚，自己还是熬了过来，第二天还是会告诉自己：我愿意一直尝试。如果无能为力，那就顺其自然。如果事与愿违，相信那是上天另有安排。如果机遇砸中，那也让自己有所准备。 2016，鸡汤，无论是毒还是其他，都已过去 2017，我还是会努力。 关于爱情2016年，依旧单身，一个人去看书，一个人去吃饭逛街。偶尔熬夜写写代码······有时候也会笑着对自己说：慢慢也会习惯一个人。 但有时候看到超市里购物的情侣，马路上情侣相互牵手的背影，温暖还是直击内心。爱情自有它的道理，两个人在一起，能比一个人过的更好。如今一个人，那另一个人也许还在路上。 2016，一个人走过。 2017，假如能够遇见你，我想和你在一起。 关于遇见2016遇见了不少人，我总觉得缘分是一个很神奇的东西，它会让你在不经意间遇见一些人，这些人也许会一直在你生命里，也许只是路过，但相遇了，总有痕迹。很感谢的是在2016年的最后两个月里能遇见某个人。 2016，缘分带来相遇。 2017，在人生的路上去相遇。 关于自己2016，算是一个转折的年份，在这一年里，看似只是从大三变成了大四，但也终究要慢慢走向社会。随着成长，陪伴的人可能会变少，也要学会自己独自出发。但我还是会记得支持我的人，与我彻夜聊天的人，关心我的人。是这些人组成了我生命里的一点一滴的温暖，而这些温暖让我闯过阴霾和黑暗。 关于工作2016的下半年，默默准备公考，在题海中奋战。还偶尔会有那么一段不怎么想学习的时候，忙忙碌碌却又觉得迷茫无奈。 但偶尔还会感慨：正是这些奋战的日子，让自己成长。自己所受的苦，总有一天会照亮自己未来的路。以后的自己也会感谢今天拼搏的自己。只有努力了，才会有所准备，才能叩开那机遇和幸运的大门。 2016，再辛苦的，也都坚挺过来了。 2017，再辛苦的，也能笑着面对。 2016的我，也许冲动过，爱过，失败过，进步过·····这些都是2016年的我，真实的我。 2017，我会在冲动后学会理智，在爱过后收获智慧和成长，在进步后能发光发彩······我会继续前行。 ​ 再见，2016 ​ 你好，2017 ​ ··············","categories":[],"tags":[{"name":"-生活","slug":"生活","permalink":"http://angellyh.coding.me/tags/生活/"}]},{"title":"12月第一篇随笔","slug":"12月第一篇随笔","date":"2016-12-05T15:05:30.000Z","updated":"2016-12-05T16:06:35.251Z","comments":true,"path":"posts/2016/12/05/12月第一篇随笔.html","link":"","permalink":"http://angellyh.coding.me/posts/2016/12/05/12月第一篇随笔.html","excerpt":"感觉距离上一篇的文章时间过了很久的样子，那一段时间都是在准备考公的事，如今暂时告了一段落，那今天来聊聊自己学了计算机成为程序猿之后的一些变化吧。o(￣▽￣)","keywords":[],"text":"感觉距离上一篇的文章时间过了很久的样子，那一段时间都是在准备考公的事，如今暂时告了一段落，那今天来聊聊自己学了计算机成为程序猿之后的一些变化吧。o(￣▽￣) 第一个变化就是口头禅。前几天在知乎上闲逛的时候看到的一个很好玩的问题：计算机系的学生都有哪些口头禅，看完之后莫名感觉几乎都被说中了（捂额头······），最简洁的口头禅就是下面这几个： 在我这是好好的，不信你来看看； 真是奇怪，刚刚还好好的； 肯定是数据问题； 你清下缓存试试； 你重启下电脑试试； 你装的什么版本的类库（jdk）； ················ 莫名想起平时分组做系统，网站的时候我们小组平时讨论时也会这样说，比如: 你看在我电脑上的效果不是这样的，不信你来看； 你重启下环境试试； 你这样用户体验不好； 应该是你的版本不对； 你这样的用户体验不好； ··········· 说起我们宿舍的三人组，也是挺神奇的，三个人三种语言，一个平时写php，一个平时写JavaMVC，我则是写Python，所以一旦合作起来的时候总是会各说各的，不过合作起来是真的挺开心的（不过我们之间居然没有讨论“PHP是世界上最好的语言”这回事，也是神奇。逃走······） 第二个变化就是我电脑的软件吧。自从成为了程序猿，我对于软件的偏好变成了开源向，能用开源软件代替的我都用了开源软件代替，而且讲真很多开源软件做的挺好的，噢，对了除了开源向就是跨平台向，这个就是为了自己能在Linux上用的同时也能在Windows上用，毕竟平时Windows用的也不少。比如跨平台的网易云，为知笔记，sublime，vscode等等都是我喜爱的软件。顺便一提的就是我电脑里目前只有谷歌，火狐还有ie三款浏览器（不要问我为何有IE，因为有些网站必须用 IE才能打开，至于是什么网站我就不说了······） 第三个变化是爱上了用markdown去写东西。之所以选择用为知笔记的其中一个原因就是因为它支持markdown，markdown的方便让我爱不释手，让我除了平时必要的时候（比如学校要交的资料等等学习工作中的东西）基本不用word去写东西了。 第四个变化我的生活圈变多了。比如扣扣群里面的“吾爱python”等两三个Python的群，既可以求助大牛自己即使搜索也不懂的问题，也可以尽自己能力去回答别人的问题，让我在里面认识了不少全国各地的人，平时大家下班了有空了也可以偶尔小聊一下生活中的事，还可以接触到大城市里IT工作的情况；又比如微信里面因为关注了phoal大神公众号（微信号：phodal-weixin）后加入了大神女朋友——也就是花花姐（微信号：yiwanbaimizhou)的微信群，在里面又认识了不少的人,还在今天很开心地收到了花花姐从深圳寄来的明信片&lt;(￣︶￣)&gt;（其实是因为前面几天忘了去收发室领，pie飞自己······） 总之，感觉成为程序猿之后自己的生活圈大了不少，认识很多挺有趣的人~ 还有一个变化就是自己的思想的变化。撸代码锻炼了自己逻辑思维，也锻炼了耐心。因为有时候撸起代码来是真的停不下来的，有时候是为了解决出现的bug，有时候是在一边看资料一边撸，也就是所谓的“编程的热情”吧。此外，成为一名程序猿之后会有很多的好奇感，比如网易云的每日推荐很赞，我有时候会想这是怎么实现的·····而且我还会关注很多新的东西，互联网是日新月异的，而这也是IT的一个缩影，里面新奇的东西总能让你有着很多的新鲜感。 今天就说到这里吧，其实成为一个程序猿是一件很有趣的事情，我挺开心自己能成为一名程序猿的。晚安：）","categories":[],"tags":[{"name":"随笔","slug":"other","permalink":"http://angellyh.coding.me/tags/other/"}]},{"title":"机会的大门不能空手叩响，你需要手里端着东西给守门人看","slug":"公考加油","date":"2016-10-26T14:30:27.000Z","updated":"2016-10-26T15:49:44.384Z","comments":true,"path":"posts/2016/10/26/公考加油.html","link":"","permalink":"http://angellyh.coding.me/posts/2016/10/26/公考加油.html","excerpt":"你所羡慕的东西都是需要你有备而去的。当你足够渴望达成一个目标时，那就去做好自己能做的一切准备吧，老天会替你完成剩余的部分。","keywords":[],"text":"你所羡慕的东西都是需要你有备而去的。当你足够渴望达成一个目标时，那就去做好自己能做的一切准备吧，老天会替你完成剩余的部分。 突然想写这个文是因为在准备公考的过程偶有了些许感触，人生的道路上总会有着要自己独自拼搏努力的时候，在这过程中会有疲惫，会有迷茫，会有孤独，只有当你适应了这些并最终一直行走在路上，才会有机会得到你想要的东西。 以前总是看到有人问，是不是真的有那么一种人，生来能力出众？是不是真有这种人，可以把任何事做到最好，打小就是妈妈口中“别人家的孩子”？ 人通常都是这样，时常羡慕很多事情，这是本能，是好事，因为有目标才会有动力。但是很多时候，我们更愿意把别人的成功的原因归结为他的家境、天赋、运气、机遇种种，却从未想到过他为此做的准备。 记得很小时候学语文学过的一篇文章，叫“卖油翁”，市场上很多人看到卖油翁那仿佛演出一般的倒油技巧，都觉得是他的天赋，但其实不然，这只不过是唯手熟尔，多练了自然而然就会了。 拥有比别人得天独厚的优势固然重要，掌握比别人更好的机遇也必不可少。但更多时候，决定成败的还是我们在机遇来临前所做的准备。就像没有人会关心你在健身房流过的汗水，没有人听到你在跑步机上的哀嚎，没有人看到过你闭着眼吃素餐，他们只会在许久不见你后感叹你瘦了，然后让你传授运动的方法和减淝食谱。但你必须明白，自己所做的一切都不是徒劳，它们是一个胖子可以咸鱼翻身的全部资本，是如今你得到鲜花和掌声的前提。 一路的孤独、疲惫、落寞，是自己；别人看到的光鲜、阳光、暖心，也全部是自己。只是别人看到的是结果，而自己熟知的是其中的过程。我们都是张三李四一样的平凡人，一夜暴富、一夜爆红或者一夜成名这样的小概率事件，和我们相距甚远。我们能做的，不过是在机遇来临之前，做好自己该做的一切，准备好应该有的一切。 既然羡慕别人无忧的生活，我们就必须在此之前学会自律和规则。既然羡慕别人在职场嬉笑怒骂，我们就必须能力出众，让自己独一无二。 在这个世界上，如果你很想很想达成一个目标，你为之而足够渴望，并且做好一切准备时，老天会替你完成剩余的部分。你要做的就是，去一直前行，跨过挫折、疲惫、落寞和困难，一直走在路上，有备而来，从不停歇。就算在达成之前，你已经觉得无路可进了，到头来，机会还是会来。到达目的地的航线，常常不是我们凭空在地图上画出的路。恰恰在经过足够的渴望和迂回的努力路线中，我们最终会有所斩获。也许还有四个月，也许也还有半年甚至更久。我现在要做的也只有再继续做着自己能做的准备，然后去面对无硝烟的战场。机会的大门，不会空手叩响，你需要手里端着一些东西，在叩响大门时，给从门缝中窥视的守门人。 想赶上机会的列车，那最好离站台不太远。那就加油吧，晚安，世界。：）","categories":[],"tags":[{"name":"生活","slug":"life","permalink":"http://angellyh.coding.me/tags/life/"}]},{"title":"编程习惯","slug":"编程","date":"2016-10-09T03:35:52.000Z","updated":"2016-11-03T04:24:11.000Z","comments":true,"path":"posts/2016/10/09/编程.html","link":"","permalink":"http://angellyh.coding.me/posts/2016/10/09/编程.html","excerpt":"养成编程的一些好习惯会让你和别人都变舒服编程就像写文章，如果你乱写一通，那不仅你自己回来看的时候觉得很别扭，别人看你的东西也会觉得一头雾水，正所谓字如其人，字好看又条理清楚的文章让人觉得作者是个不错的人，同理写得好且好看的程序也会让人对程序员产生好感 以下内容来自知乎以及平时自己的编程经验","keywords":[],"text":"养成编程的一些好习惯会让你和别人都变舒服编程就像写文章，如果你乱写一通，那不仅你自己回来看的时候觉得很别扭，别人看你的东西也会觉得一头雾水，正所谓字如其人，字好看又条理清楚的文章让人觉得作者是个不错的人，同理写得好且好看的程序也会让人对程序员产生好感 以下内容来自知乎以及平时自己的编程经验 遇到不清楚或不懂的知识点，先去看官方文档！ 先！去！看！官方！！文档！！！！ 很多官方文档是英文的，硬着头皮也要看！看着看着就习惯了。 刚开始读英文文档会费时间和精力，但是等你回过头来再看，你会觉得这才是最恰当的选择。 首先你的英文水平得到提升（这是程序员无法回避的问题），耐性得到锻炼。 其次，什么叫官方文档？！两个字：权威！准确！当你发现网上有些库的介绍是似是而非，似懂非懂的答案的，甚至有的文章观点完全不一样，你就会懂我在说什么了。 当然，我并没有否认网上有好的答案和文章，我自己也经常看别人的博客。 只是，作为初学者，你的水平很难去辨别一些文章，观点的好坏对错，而这可能会对你理解一些知识带来致命的误导！ 不要过分纠结于“怎样把代码写得更短”或者“把代码写进一行”。 比如写这种是想怎样。。： 1print filter(lambda x: len(filter(lambda y: x % y == 0, xrange(2, int(sqrt(x) + 1)))) == 0, xrange(2, 100) 至少在同一个项目里，遵循统一的命名原则。 比如这种，顺手随便写的吧·····： 12345678class Test(object):...class ShuRuTest(Test):...class shuchu_ceshi(Test):... 如果有比较通用的广为接受的格式标准，请务必遵守。 比如python的pep8等诸如此类 代码较长时记得写好注释，整个项目写好文档。 几十行的小程序小脚本写个说明也好；几百几千行的不写注释维护起来太麻烦。最可恨是项目没文档，别说转手了，就自己过个小半年再来看都会想“这是什么鬼，怎么想不起来了”。 看看别人写的好的的源码是怎么写注释的，比如类的注释的格式和内容应该怎样 注释什么时候写？ 写代码之前写一部分，调试时候写一部分，写完代码之后补一部分。 写代码之前的：等于是你的提纲，也是后来人理解你代码的途径 调试时候的： //print tom.age 调试时候你打印的变量，可能是后来人改代码时的关键检查点，不要都删光，当然也不要太多，更不要不注释掉就那么留在代码里 写完功能后：对于不好理解的地方再补点注释，原则是后人改代码时候一眼就看清你的思路 顺便说一句，用英文写注释确实逼格很高，但是···对于英文不好的同学，就不要在注释里强秀英文了……过俩月就算有注释自己都看的吃力甚至看不懂了 尽量拆分函数功能及类，保证一个函数只做一件事，不要全堆一个函数里。 如果你一个函数写了几百行，一个函数六七重循环，那你真得想想该怎么改了 变量命名写清楚，不要p1,p2,p3这样的 保证代码的版本管理，每天结束工作 push remote,我用的是git。当然也可以用svn 考虑好异常处理，无论用if还是try。 务必看懂错误提示。编译器（解释器）及运行时给出的错误提示务必看懂。常见的也就那么些个单词，就那么几项概念，看明白就不用带个错误提示满世界找人问“为什么出现这个错误”···对于这种我想说请记记平时常见的计算机英语单词，然后打开浏览器google好不好···· 就说这么多，以后想到了再补：）","categories":[],"tags":[{"name":"编程","slug":"programming","permalink":"http://angellyh.coding.me/tags/programming/"},{"name":"随笔","slug":"other","permalink":"http://angellyh.coding.me/tags/other/"}]}]}